In [1]:
%load_ext sql
import pandas as pd
import sqlite3

In [2]:
%sql sqlite:///CourseData.db
conn = sqlite3.connect('CourseData.db')

In [3]:
%%sql
SELECT locationID, LocationCode
FROM Locations
LIMIT 10

 * sqlite:///CourseData.db
Done.

[(1, 'BCC 200'),
 (2, 'BD '),
 (3, 'BH '),
 (4, 'BH BY ARR'),
 (5, 'BLM 112'),
 (6, 'BLM LL105'),
 (7, 'BNW 124'),
 (8, 'BNW 127'),
 (9, 'BNW 128'),
 (10, 'BNW 129B')]

In [4]:
locations_df = _.DataFrame()
locations_df

   LocationID LocationCode
0           1      BCC 200
1           2          BD
2           3          BH
3           4    BH BY ARR
4           5      BLM 112
5           6    BLM LL105
6           7      BNW 124
7           8      BNW 127
8           9      BNW 128
9          10     BNW 129B

In [5]:
%%sql
SELECT *
FROM sqlite_master

 * sqlite:///CourseData.db
Done.

[('table', 'COURSE_FACT_TABLE', 'COURSE_FACT_TABLE', 2, 'CREATE TABLE COURSE_FACT_TABLE(\n    CourseID INTEGER,\n    CatalogID TEXT NOT NULL,\n    Term TEXT NOT NULL,\n    CRN INTEGER NOT NULL,\n    Section ... (404 characters truncated) ... REIGN KEY(LOCATIONID)\n   -- CONSTRAINT INSTRUCTOR_ID FOREIGN KEY(INSTRUCTORID)\n   -- CONSTRAINT COURSE_OFFERING_ID FOREIGN KEY(COURSEOFFERINGID)\n)'),
 ('table', 'PROGRAMS', 'PROGRAMS', 3, 'CREATE TABLE PROGRAMS (\n    ProgramID INTEGER PRIMARY KEY,\n    ProgramCode TEXT NOT NULL,\n    ProgramName TEXT NOT NULL\n)'),
 ('table', 'CATALOG_COURSES', 'CATALOG_COURSES', 4, 'CREATE TABLE CATALOG_COURSES (\n    CourseID INTEGER PRIMARY KEY,\n    CatalogYear TEXT NOT NULL,\n    CatalogID TEXT NOT NULL,\n    ProgramID INTEGE ... (74 characters truncated) ... s TEXT,\n    Coreqs TEXT,\n    Fees TEXT,\n    Attributes TEXT,\n    Description TEXT,\n    FOREIGN KEY (ProgramID) REFERENCES PROGRAMS(ProgramID)\n)'),
 ('table', 'INSTRUCTORS', 'INSTRUCTORS', 5, 'CREATE TABLE INSTRUCTORS (\n    InstructorID INTEGER PRIMARY KEY,\n    Name TEXT NOT NULL\n)'),
 ('table', 'COURSE_OFFERINGS', 'COURSE_OFFERINGS', 6, 'CREATE TABLE COURSE_OFFERINGS (\n    CourseOfferingID INTEGER PRIMARY KEY,\n    CourseID INTEGER,\n    CatalogID TEXT NOT NULL,\n    Term TEXT NOT NU ... (249 characters truncated) ... ULL,\n    FOREIGN KEY (CourseID) REFERENCES CATALOG_COURSES(CourseID),\n    FOREIGN KEY (PrimaryInstructorID) REFERENCES INSTRUCTORS(InstructorID)\n)'),
 ('table', 'LOCATIONS', 'LOCATIONS', 7, 'CREATE TABLE LOCATIONS (\n    LocationID INTEGER PRIMARY KEY,\n    LocationCode TEXT NOT NULL\n)'),
 ('table', 'COURSE_MEETINGS', 'COURSE_MEETINGS', 8, 'CREATE TABLE COURSE_MEETINGS (\n    CourseMeetingID INTEGER PRIMARY KEY,\n    CourseOfferingID INTEGER NOT NULL,\n    LocationID INTEGER NOT NULL,\n  ... (63 characters truncated) ... \n    FOREIGN KEY (CourseOfferingID) REFERENCES COURSE_OFFERINGS(CourseOfferingID),\n    FOREIGN KEY (LocationID) REFERENCES LOCATIONS(LocationID)\n)'),
 ('table', 'TERM_CATALOG_YEAR', 'TERM_CATALOG_YEAR', 9, 'CREATE TABLE TERM_CATALOG_YEAR (\n    CatalogYear TEXT NOT NULL,\n    Term TEXT NOT NULL\n)'),
 ('index', 'ix_catalog_courses_alt_key', 'CATALOG_COURSES', 10, 'CREATE INDEX ix_catalog_courses_alt_key on CATALOG_COURSES(CatalogYear,CatalogID)'),
 ('index', 'ix_instructors_name', 'INSTRUCTORS', 11, 'CREATE INDEX ix_instructors_name on INSTRUCTORS(Name)'),
 ('index', 'ix_course_offerings_alt_key', 'COURSE_OFFERINGS', 12, 'CREATE INDEX ix_course_offerings_alt_key on COURSE_OFFERINGS(Term,CatalogID,Section)')]

In [9]:
%%sql
SELECT CATALOGYEAR, COURSETITLE, PREREQS
FROM CATALOG_COURSES
WHERE PREREQS >=1
LIMIT 5;

 * sqlite:///CourseData.db
Done.

[('2017_2018', 'Legal Environment of Business', 'Junior standing.'),
 ('2017_2018', 'The Law of Contracts, Sales, and Property', 'BU 0211.'),
 ('2017_2018', 'The Law of Business Organizations and Financial Transactions', 'BU 0211.'),
 ('2017_2018', 'Seminar in Business Law and Ethics', 'AE 0291, BU 0211, two additional courses in law or applied ethics.'),
 ('2017_2018', 'Biomechanics', 'MA 0145, PS 0115.')]